cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/versions'
tap 'derekkwok/python'
tap 'caskroom/fonts'

# pre-req for libcaca and libgit2 can work
cask 'xquartz'

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node@6'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'sqlite'
brew 'git'
brew 'heroku'
brew 'python'
brew 'python3'
brew 'redis'
brew 'elixir'
brew 'postgresql'

cask 'font-fira-code'
# cask 'google-chrome'
# cask 'dropbox'
# cask 'dash'
# cask 'iterm2'
# cask 'alfred'
# cask 'keka'
# cask 'skype'
# cask 'slack'
# cask 'gitkraken'
# cask 'postico'
# cask 'sublime-text3'
# cask 'transmission'
# cask 'vlc'
